site/sfguides/src/loadtesting_jmeter/QAS.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="JDBC Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="Load Testing" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">Report_WH1</stringProp>
          <stringProp name="dbUrl">jdbc:snowflake://mysnowflake.myregion/?db=DB1&amp;schema=schema_db&amp;warehouse=main_wh&amp;role=accountadmin</stringProp>
          <stringProp name="driver">net.snowflake.client.jdbc.SnowflakeDriver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">pw</stringProp>
          <stringProp name="poolMax">30</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">username</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <RandomOrderController guiclass="RandomOrderControllerGui" testclass="RandomOrderController" testname="Random Order Controller" enabled="true"/>
        <hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-1" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915507461</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-2" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915561120</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-3" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915520999</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-4" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915450946</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-5" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915050849</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-6" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915161507</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-7" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915169730</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-8" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915501317</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-9" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915323235</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
          <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="request-10" enabled="true">
            <stringProp name="dataSource">Report_WH1</stringProp>
            <stringProp name="queryType">Select Statement</stringProp>
            <stringProp name="query">select * from SFSALESSHARED_SFC_SAMPLES_VA3_SAMPLE_DATA.TPCH_SF1000.LINEITEM where L_ORDERKEY = 5915452741</stringProp>
            <stringProp name="resultSetHandler">Store as String</stringProp>
          </JDBCSampler>
          <hashTree>
            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
              <stringProp name="ConstantTimer.delay">0</stringProp>
              <stringProp name="RandomTimer.range">5000</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="Response Times" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <boolProp name="ResultCollector.success_only_logging">true</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>